software/index.en.org
#+TITLE: My Repository@Github
#+DATE: 2017-01-15 18:47:25
#+LANGUAGE: en
#+REF: software
#+SETUPFILE: ../_setup.org
#+PERMALINK: /software/index.en.html
* What's this ?
  My Github repositories. Patch welcome! :-)
** [[/software/rdtool/index.en.html][RDtool: formatter for RD]]
   RD is Ruby' POD. RDtool is formatter for RD.

   RD is multipurpose documentation format created for documentating Ruby
   and output of Ruby world. You can embed RD into Ruby script. And RD have
   neat syntax which help you to read document in Ruby script. On the other
   hand, RD have a feature for class reference.
** [[/software/rail/index.en.html][Rail: Replace Agent-string Internal Library]]

   RAIL is a elisp library, translates codenames with latin chars of FLIM/SEMI/XEmacs/UTF-2000-Mule/Meadow to Japanese characters (On irchat-pj, Japanize code name for &ldquo;CTCP VERSION&rdquo; return string).

   It also provides a function compatible with genjis.el (a partof tm, that converts mule-version to Japanese characters).

   - Github Repos:: https://github.com/uwabami/rail
   - If you have any questions, comment, bug reports, please report Githb Issues
   - For Debian/Ubuntu Users: simply
   #+BEGIN_EXAMPLE
     % sudo apt-get install rail
   #+END_EXAMPLE
** [[/software/tdiary-style-org/index.en.html][TDiary::Style::Org]]
   The =TDiary::Style::Org= is provide [[http://orgmode.org/][Org-mode]] style for [[http://www.tdiary.org/][tDiary]]
