software/index.en.html
---
title: My Repository@Github
date: 2017-01-15 18:47:25
layout: default
lang: en
ref: software
permalink: /software/index.en.html
---
<div id="outline-container-orgfaf6e1f" class="outline-2">
<h2 id="orgfaf6e1f">What's this ?</h2>
<div class="outline-text-2" id="text-orgfaf6e1f">
<p>
My Github repositories. Patch welcome! :-)
</p>
</div>
<div id="outline-container-org8860d0d" class="outline-3">
<h3 id="org8860d0d"><a href="file:///software/rdtool/index.en.html">RDtool: formatter for RD</a></h3>
<div class="outline-text-3" id="text-org8860d0d">
<p>
RD is Ruby' POD. RDtool is formatter for RD.
</p>

<p>
RD is multipurpose documentation format created for documentating Ruby
and output of Ruby world. You can embed RD into Ruby script. And RD have
neat syntax which help you to read document in Ruby script. On the other
hand, RD have a feature for class reference.
</p>
</div>
</div>
<div id="outline-container-orga324fd3" class="outline-3">
<h3 id="orga324fd3"><a href="file:///software/rail/index.en.html">Rail: Replace Agent-string Internal Library</a></h3>
<div class="outline-text-3" id="text-orga324fd3">
<p>
RAIL is a elisp library, translates codenames with latin chars of FLIM/SEMI/XEmacs/UTF-2000-Mule/Meadow to Japanese characters (On irchat-pj, Japanize code name for &amp;ldquo;CTCP VERSION&amp;rdquo; return string).
</p>

<p>
It also provides a function compatible with genjis.el (a partof tm, that converts mule-version to Japanese characters).
</p>

<ul class="org-ul">
<li>Github Repos:: <a href="https://github.com/uwabami/rail">https://github.com/uwabami/rail</a></li>
<li>If you have any questions, comment, bug reports, please report Githb Issues</li>
<li>For Debian/Ubuntu Users: simply</li>
</ul>
<pre class="example">
     % sudo apt-get install rail
</pre>
</div>
</div>
<div id="outline-container-org3a43d4c" class="outline-3">
<h3 id="org3a43d4c"><a href="file:///software/tdiary-style-org/index.en.html">TDiary::Style::Org</a></h3>
<div class="outline-text-3" id="text-org3a43d4c">
<p>
The <code>TDiary::Style::Org</code> is provide <a href="http://orgmode.org/">Org-mode</a> style for <a href="http://www.tdiary.org/">tDiary</a>
</p>
</div>
</div>
</div>
